Feature: Визуализиране на налични музикални парчета

  Background: отваряне на приложението
    Given отваряне на приложението

  Scenario: Визуализиране на списък с музикални парчета
    Then Визуализира се списък с музикални парчета

  Scenario: Търсене на музикално парче по име
    When потребителя въвежда име на музикално парче "Song 1" в полето за търсене
    And натиска бутона за търсене
    Then Визуализира се музикално парче с име "Song 1"

  Scenario: Филтриране на музикални парчета по жанр
    When потребителя избере жанр "Pop"
    And натиска бутона за филтриране
    Then Визуализира се списък с музикални парчета в жанр "Pop"

  Scenario: Преглед на детайлна информация за музикално парче
    When потребителя избере музикално парче с име "Song 1"
    And натиска бутона за детайлна информация
    Then Визуализира се детайлна информация за музикалното парче "Song 1"

  Scenario: Филтриране на музикални парчета по изпълнител
    When потребителя избере изпълнител "Artist 1"
    And натиска бутона за филтриране за артист
    Then Визуализира се списък с музикални парчета на изпълнител "Artist 1"
