Feature: Управление на DJ миксове

  Background: отваряне на приложението
    Given отваряне на приложението

  Scenario: Стартиране на нова DJ сесия
    When потребителят стартира нова DJ сесия с име "First Mix"
    Then системата трябва да започне записването на микса

  Scenario: Запазване на DJ сесия
    Given потребителят стартира нова DJ сесия с име "First Mix"
    When потребителят спре сесията и запази сесията като "My Saved Mix"
    Then системата трябва да съхрани сесията с името "My Saved Mix"

  Scenario: Навигиране до секцията със запазени сесии
    When потребителят навигира до секцията със запазени сесии
    Then системата трябва да покаже списък със запазени сесии

  Scenario: Добавяне на песен към DJ сесия
    Given потребителят стартира нова DJ сесия с име "First Mix"
    When потребителят добавя песен с име "Song 1" към сесията "First Mix"
    Then системата трябва да съдържа песен с име "Song 1" в сесията "First Mix"

  Scenario: Премахване на песен от DJ сесия
    Given потребителят стартира нова DJ сесия с име "First Mix"
    And потребителят добавя песен с име "Song 2" към сесията "First Mix"
    When потребителят премахва песен с име "Song 2" от сесията "First Mix"
    Then системата не трябва да съдържа песен с име "Song 2" в сесията "First Mix"
